<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body>
    <?php
/*   1.	Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'. */
    
    $arr = ['Privet', 'mir', '!'];
    echo $arr[0] .' ' .$arr[1] .' ' .$arr[2];
    echo '<br>';
    
 /*   2. Создайте массив. Выведите на экран, например, элемент с ключом 'c'. */
    
   $arr = ['j','o','c','q' ];       
    echo $arr[2];  
    
/*   3. Создайте массив заработных плат $arr. Выведите на экран зарплату Пети и Коли.*/
    
   $arr = [
       
      $name => ['Петя']
   ] 
    ?>
    
    
    
    
</body>
</html>