<!--№1 Создайте переменную $var и присвойте ей значение 'hello'.
Обращаясь к отдельным символам этой строки выведите на экран символ 'h', символ 'e', символ 'o'.-->
   <?php
    $var = 'helo';
    echo $var[0],$var[1],$var[3].'<br>';

//  №2 Создайте переменную $a и присвойте ей значение 3. Выведите значение этой переменной на экран.
    $a = 3;
    echo $a.'<br>';


//   №3 Создайте переменные $a=10 и $b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления)

    $a = 10;
    $b = 2;
    echo $a*$b.'<br>';
    echo $a+$b.'<br>';
    echo $a-$b.'<br>';
    echo $a/$b.'<br>';

//    №4 Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат присвойте переменной $result. Выведите на экран значение переменной $result.
    $c = 15;
    $b = 2;
    $result = $b + $c ;
    echo $result.'<br>' ;

//
//    №5 Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и результат присвойте переменной $c.
// Затем создайте переменную $d, присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result.
// Выведите на экран значение переменной $result.
    $a = 17;
    $b = 10;
    $c = $a - $b;
    $d = 7;
    $result = $c + $d ;
    echo $result.'<br>' ;

   //    №6 Напишите скрипт, который считает количество секунд в часе.
    $a = 60;
    $b = 60;
    $result = $a * $b;
    echo $result.'<br>' ;


 //  №7 Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, --.
   // Количество строк кода при этом не должно измениться.
	$var = 1;
	$var += 12;
	$var -= 14;
	$var *= 5;
	$var /= 7;
	$var += 1;
	$var -= 1;
	echo $var.'<br>';

    // №8  Создайте переменную $age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'
    $age = 10;
    echo 'Мне '.$age.' лет! '.'<br>';

    //№9 Создайте переменную $num и присвойте ей значение '12345'. Найдите сумму цифр этого числа.
    $num = '12345';
     echo $num[0] + $num[1]+ $num[2]+ $num[3] +$num[4].'<br>';

?>