<!--№1 Создайте переменную $var и присвойте ей значение 'hello'. Обращаясь к отдельным символам этой строки выведите на экран символ 'h', символ 'e', символ 'o'.-->
   <?php
    $var = 'helo<br>';
    echo var[0,1,3];
    ?>
    
   №2 Создайте переменную $a и присвойте ей значение 3. Выведите значение этой переменной на экран.
<?php
    $a = 3;
    echo a;
    ?>
    
   №3 Создайте переменные $a=10 и $b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления)
<?php
    $a = 10;
    $b = 2;
    echo $a*$b <br> $a+$b <br> $a-$b <br> $a/$b ;
    ?>
    №4 Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат присвойте переменной $result. Выведите на экран значение переменной $result.
   <?php
    $c = 15;
    $b = 2;
    $result = $b + $c ;
    echo $result ;
    ?> 
    
    №5 Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и результат присвойте переменной $c. Затем создайте переменную $d, присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result. Выведите на экран значение переменной $result.
<?php
    $a = 17;
    $b = 10;
    $c = $a - $b;
    $d = 7;
    $result = $c + $d ;
    echo $result ;
    ?> 
    
    
    №6 Напишите скрипт, который считает количество секунд в часе.
   <?php
    $a = 60;
    $b = 60;
$c = $a * $b;
$result = $c;
?>
   
   №7 Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, --. Количество строк кода при этом не должно измениться. 
   
   <?php
	$var = 1;
	$var += 12;
	$var -= 14;
	$var *= 5;
	$var /= 7;
	$var += 1;
	$var -= 1;
	echo $var;
?>

 №8  Создайте переменную $age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'
 
 <?php
 $age = 10;
 echo 'Мне' . $age . 'лет!';
?> 
  
№9 Создайте переменную $num и присвойте ей значение '12345'. Найдите сумму цифр этого числа.
<?php
$num = '12345';
echo '1'+'2'+'3'+'4'+'5';
?>  