<?php
/**
 * Created by PhpStorm.
 * User: ANNA
 * Date: 31.03.2019
 * Time: 15:13
 */

/*
 * 1. Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'.
 * */

    $arr = ['Привет', 'мир', '!'];
    echo $arr[0].' '.$arr[1] .' '.$arr[2];
    echo '<br>';

 /*   2. Создайте массив. Выведите на экран, например, элемент с ключом 'c'. */

    $arr = ['j','o','c','q' ];
    echo $arr[2];
    echo '<br>';
    $arr1 = ['j' =>'value1','o' =>'value2','c' =>'value3','q' =>'value4' ];
    echo $arr1['c'];
    echo '<br>';
/*   3. Создайте массив заработных плат $arr. Выведите на экран зарплату Пети и Коли.*/

   $arr = [
       'Петя' =>['salary' => 500],
       'Коля' =>['salary' => 1000 ]
   ];
   echo $arr['Петя']['salary'];
   echo '<br>';
   echo $arr['Коля']['salary'];
    echo '<br>';

    $arr1 = [
           'Петя' =>500 ,
           'Коля' => 1000
       ];
    echo '<br>';
    echo $arr1['Коля'];
    echo '<br>';
    echo $arr1['Петя'];
    echo '<br>';


/*
    4. Создайте массив со значениями 'a', 'b', 'c'. Выведите значение массива на экран с помощью функции var_dump().
    */

    $arr = ['a','b','c','d' ];
    var_dump($arr);
echo '<br>';

/*
5. С помощью массива из предыдущей задачи выведите на экран содержимое первого,
 второго и третьего элементов в отдельных тегах, например используйте тег <p>.
*/


$arr = ['a','b','c','d' ];
foreach ($arr as &$value) {
    $value='<p>'.$value.'</p>';
}
unset($value);
print_r($arr);
echo '<br>';
/*
6. Создайте массив $arr. Найдите сумму элементов этого массива.
*/

$arr = [1,2,5,6,7,12 ];

echo array_sum($arr);
echo '<br>';

/*
7. Создайте ассоциативный массив дней недели. Ключами в нем должны служить номера дней от начала недели
(понедельник - должен иметь ключ 1, вторник - 2 и т.д.). Выведите на экран текущий день недели
*/

$arr1 = [1 =>'Понедельник',2 =>'Вторник',3 =>'Среда',4 =>'Четверг',5 =>'Пятница',6 =>'Суббота',7 =>'Воскресенье' ];
echo date("N");
echo '<br>';
echo $arr1[date("N")] .'<br>' ;
/*
 8. Создайте многомерный массив. С его помощью выведите на экран слова 'joomla', 'drupal', 'зеленый', 'красный'.

 */


$arr2[0][0]="joomla";
$arr2[0][1]="drupal";
$arr2[1][0]="зеленый";
$arr2[1][1]="красный";

for ($q=0; $q<2; $q++) {
    for ($w=0; $w<2; $w++) {
        echo $arr2[$q][$w]." ";
    }
    echo '<br>';
}


/*9.Создайте двухмерный массив. Первые два ключа - это 'ru' и 'en'. Пусть первый ключ содержит элемент, являющийся
массивом названий дней недели по-русски, а второй - по-английски. Выведите с помощью этого массива понедельник по-русски
и среду по английски (пусть понедельник - это первый день).
*/
$weekRu= [1 =>'Понедельник',2 =>'Вторник',3 =>'Среда',4 =>'Четверг',5 =>'Пятница',6 =>'Суббота',7 =>'Воскресенье' ];
$weekEn= [1 =>'Monday',2 =>'Tuesday',3 =>'Wednesday',4 =>'Thursday',5 =>'Friday',6 =>'Saturday',7 =>'Sunday' ];
$arr = [
    'ru' =>$weekRu,
    'en' =>$weekEn
];

echo $arr['ru'][1];
echo '<br>';
echo $arr['en'][2];
echo '<br>';

/*10. Пусть теперь в переменной $lang хранится язык (она принимает одно из значений или 'ru', или 'en' - либо то,
либо то), а в переменной $day - номер дня. Выведите словом день недели, соответствующий переменным $lang и $day.
 То есть: если, к примеру, $lang = 'ru' и $day = 3 - то выведем 'среда' *.
*/

$lang = 'ru';
$day = 3;
echo $arr[$lang][$day];
echo '<br>';


/*Конструкции if else

 1. Если переменная $a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
Проверьте работу скрипта при $a, равном 1, 0, -3. */

$arr = [1,0,-3 ];
foreach ($arr as $a) {
    if ($a == 0){
        echo 'Верно'.'<br>';
    }else {
        echo 'Неверно' .'<br>';
    }
}

/*2. Если переменная $a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при $a, равном 1, 0, -3.
*/
echo '---------------'.'<br>' ;

$arr = [1,0,-3];
foreach ($arr as $a) {
    if ($a <= 0){
        echo 'Верно'.'<br>';
    }else {
        echo 'Неверно' .'<br>';
    }
}

/*3. Если переменная $a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'.
 Проверьте работу скрипта при $a, равном 'test', 'тест', 3*/
echo '---------------'.'<br>' ;

$arr = ['test','тест',3];
foreach ($arr as $a) {
    if ($a == 'test'){
        echo 'Верно'.'<br>';
    }else {
        echo 'Неверно' .'<br>';
    }
}

/*4. Если переменная $a пустая, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при $a,
равном 1, 3, -3, 0, null, true, '', '0'. (empty())*/
echo '---------------'.'<br>' ;
$arr = [1, 3, -3, 0, null, true, '', '0'];
foreach ($arr as $a) {
    if (!empty($a)){
        echo 'Неверно' .'<br>';
    }else {
        echo 'Верно'.'<br>';
    }
}


/*
 * 5. Если переменная $a НЕ пустая, то выведите 'Верно', иначе выведите 'Неверно'. (empty())

 */
echo '---------------'.'<br>' ;
$arr = [1, 3, -3, 0, null, true, '', '0'];
foreach ($arr as $a) {
    if (!empty($a )){
        echo 'верно' .'<br>';
    }else {
        echo 'неверно'.'<br>';
    }
}

/*
 * 6. Если переменная $a существует, то выведите 'Верно', иначе выведите 'Неверно'.
 *  Проверьте работу скрипта при $a, равном 3 и null. (isset())

 */

echo '---------------'.'<br>' ;
$arr = [ 3, null ];
foreach ($arr as $a) {
    if (isset($a)){
        echo 'верно' .'<br>';
    }else {
        echo 'неверно'.'<br>';
    }
}


/*
 * 7. Если переменная $a НЕ существует, то выведите 'Верно', иначе выведите 'Неверно'. (isset())

 */
echo '---------------'.'<br>' ;
$arr = [ 3, null ];
foreach ($arr as $a) {
    if (!isset($a)){
        echo 'верно' .'<br>';
    }else {
        echo 'неверно'.'<br>';
    }
}

/*
 * 8. Если переменная $a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'.
 *  Проверьте работу скрипта при $a, равном 5, 0, -3, 2.
 */
echo '---------------'.'<br>' ;
$arr = [5,0,-3,2 ];
foreach ($arr as $a) {
    if ($a > 0 && $a <5){
        echo 'Верно'.'<br>';
    }else {
        echo 'Неверно' .'<br>';
    }
}

/*
 * 9. Если переменная $a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
 *  Выведите новое значение переменной на экран. Проверьте работу скрипта при $a, равном 5, 0, -3, 2 *.
 */

echo '---------------'.'<br>' ;
$arr = [5,0,-3,2 ];
foreach ($arr as $a) {
    if ($a == 0 || $a  == 2){
        echo $a + 7 .'<br>';
    }else {
        echo $a / 10 .'<br>';
    }
}


/*
 *  Конструкция Switch-Case

1 .Переменная $num может принимать одно из значений: 1, 2, 3 или 4. Если она имеет значение '1', то в
 переменную $result запишем 'зима', если имеет значение '2' – 'лето' и так далее. Решите задачу через switch-case.

 */
echo '---------------'.'<br>' ;
$num = 4;
switch ($num) {
    case 1:
        echo 'zima'.'<br>';
        break;
    case 2:
        echo 'leto'.'<br>';
        break;
    case 3:
        echo 'vesna'.'<br>';
        break;
    case 4:
        echo 'osen'.'<br>';
        break;
}

/*
 * 2 .Создать массив чисел, создать переменную в которой будет храниться знак(+, -, *, /).
 * В зависимости от знака, который хранится в переменной, произвести действия с массивом чисел *.

 */
echo '---------------'.'<br>' ;
$arr = [1,8,69,57,12];
$znaki = ['+','-','*','/'];

foreach ($znaki as $num) {

    switch ($num) {
        case '+':
            echo array_sum($arr).'<br>';
            break;

        case '-':
            $result = $arr[0];
            for ($i = 1; $i < count($arr); $i++) {
                $result -= $arr[$i];
            }
            echo $result.'<br>';
            break;

        case '*':
            echo array_product($arr).'<br>';
            break;
        case '/':
            $result = $arr[0];
            for ($i = 1; $i < count($arr); $i++) {
                $result /= $arr[$i];
            }
            echo $result.'<br>';
            break;
    }

}

/*
 * For
 */
/*1. Необходимо создать выпадающий список годов от 2000 до 2050.
 */
echo '---------------'.'<br>' ;
echo '<select name="" style="width: 150px;"  id="">';
for($i  =  2000;  $i  <  2050;  $i++){
    echo  '<option value="'.$i .'">'.$i.'</option>';
}
echo '</select>'. "<br>";

/*
 * 2.  Выведите столбец чисел от 1 до 100
 */
echo '---------------'.'<br>' ;
for ($i  =  1;  $i  <  100;  $i++)
    echo $i . "<br>";

/*
 * 3. Выведите столбец чисел от 11 до 33.
 */
echo '---------------'.'<br>' ;
for ($i  = 11 ;  $i  <  33;  $i++)
    echo $i . "<br>";

/*
 * 4.  Выведите столбец четных чисел в промежутке от 0 до 100
 */
echo '---------------'.'<br>' ;
for ($i  =  0;  $i  <  100;  $i +=2)
    echo $i . "<br>";

/*
 * 5. Отрисовать таблицу умножения
 */
echo '---------------'.'<br>' ;
$a = 5;
$b = 17;

echo "<table border=\"1px\"><tbody>";
for($i = 1; $a >= $i; $i++) {
    echo "<tr>";
    for ($j = 1; $b>= $j; $j++){
        echo "<td width=\"150px\" align=\"center\" bgcolor=\"#ff4500\">".($i*$j)."</td>";
    }

    echo "</tr>";
}
echo "</tbody></table>";

/*
 * Foreach
1.  Дан массив с элементами 10, 20, 15, 17, 24, 35. Найдите сумму элементов этого массива.
Запишите ее в переменную $result.

 */
echo '---------------'.'<br>' ;
$arr=[10, 20, 15, 17, 24, 35];
echo array_sum($arr).'<br>';



/*
 * 2. Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью цикла foreach выведите эти слова в столбик.
*/

echo '---------------'.'<br>' ;
$arr = ['html', 'css', 'php', 'js', 'jq'];
foreach ($arr as $value) {
    echo $value .'<br>';
}

/*
 * 3. Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму элементов этого массива.
 *  Запишите ее в переменную $result.
 */
echo '---------------'.'<br>' ;
$arr=[1, 2, 3, 4, 5];
$result=0;
foreach ($arr as $value) {
    $result += $value;
}

echo  $result .'<br>';


/*
 * 3.1 Дан массив с элементами 1, 2, 3, 4, 5. С помощью цикла foreach найдите сумму квадратовэлементов этого массива.
 *  Результат запишите переменную $result.
 */

echo '---------------'.'<br>' ;
$arr=[1, 2, 3, 4, 5];
$result=0;
foreach ($arr as $value) {
    $result += $value*$value;
}
echo  $result .'<br>';

/*
 * 4. Дан массив ['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'].
 *  С помощью цикла foreach выведите на экран столбец ключей и элементов в формате 'green - зеленый'.
 *  */

echo '---------------'.'<br>' ;
$arr=['green'=>'зеленый', 'red'=>'красный','blue'=>'голубой'];
foreach ($arr as $k => $value) {
    echo  "$k - $value" .'<br>';
}

/*
 * 5. Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' и с элементами '200', '300', '400'.
 * С помощью цикла foreach выведите на экран столбец строк такого формата: 'Коля - зарплата 200 долларов.'.
 */

echo '---------------'.'<br>' ;
$arr=['Коля'=>'200', 'Вася'=>'300','Петя'=>'400'];
foreach ($arr as $k => $value) {
    echo  "$k - зарплата $value долларов" .'<br>';
}

/*Задачи *
1. В переменной $day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает
это число (в первую, вторую или третью).
 */

echo '---------------'.'<br>' ;
$day = 20;
if ($day >= 1 && $day < 11)
    echo 'Первая декада';
else if ($day >= 11 && $day < 21)
    echo 'Вторая декада';
else if ($day >= 21 && $day <= 31)
    echo 'Третья декада';
else
    echo 'Неправильно введено число';
echo '<br/>';

/*
 *  2. В переменной $month лежит какое-то число из интервала от 1 до 12.
 * Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
 */
echo '---------------'.'<br>' ;
$month = 12;
if ($month >= 1 && $month < 3 || $month = 12)
    echo 'Зима';
else if ($month >= 3 && $month < 6)
    echo 'Весна';
else if ($month >= 6 && $month < 9)
    echo 'Лето';
else if ($month >= 9 && $month < 12)
    echo 'Осень';
else
    echo 'Неправильно введено число';
echo '<br/>';

/*
 * 3.  В переменной $year хранится год. Определите, является ли он високосным (в таком году есть 29 февраля).
 * Год будет високосным в двух случаях: либо он делится на 4, но при этом не делится на 100, либо делится на 400.
 * Так, годы 1700, 1800 и 1900 не являются високосными, так как они делятся на 100 и не делятся на 400.
 * Годы 1600 и 2000 - високосные, так как они делятся на 400.
 */

echo '---------------'.'<br>' ;
$year =2019;
if ($year % 100 !=0 && $year % 4 ==0 || $year % 400 ==0 )
    echo 'этот год високосный';
else
    echo 'этот год не високосный';
echo '<br/>';

/*
 *4. Дана строка с символами, например, 'abcde'. Проверьте, что первым символом этой строки является буква 'a'.
 * Если это так - выведите 'да', в противном случае выведите 'нет'.
 */
echo '---------------'.'<br>' ;
$str='abcde';
if ($str[0] == 'a'){
    echo 'da';
}else
    echo 'net';
echo '<br/>';

/*
 * 5. Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки является цифра 1, 2 или 3.
 * Если это так - выведите 'да', в противном случае выведите 'нет'.
 */
echo '---------------'.'<br>' ;
$str='12345';
$arr=[1,2,3];
if (in_array ($str[0],$arr) ){
    echo 'da';
}else
    echo 'net';
echo '<br/>';

/*
 * 6. Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий.
 */
echo '---------------'.'<br>' ;
$strl = '261';
 echo $strl[0] + $strl[1]+ $strl[2].'<br>';

 /*
  * 7. Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
  * Если это так - выведите 'да', в противном случае выведите 'нет'.
  */

echo '---------------'.'<br>' ;
$strl = '261851';
$a = $strl[0] + $strl[1] + $strl[2];
$b = $strl[3] + $strl[4] + $strl[5];
if($a == $b){
    echo 'da'.'<br>';
} else {
    echo 'net'.'<br>';
}

/*
 * 8. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if выведите на экран столбец
 * тех элементов массива, которые больше 3-х, но меньше 10.
 */
echo '---------------'.'<br>' ;
$arr  = [2, 5, 9, 15, 0, 4];
foreach ($arr as $a) {
    if ($a > 3 && $a  < 10){
        echo $a .'<br>';
    }
}

/*
 *10. Составьте массив дней недели. С помощью цикла foreach
 *  выведите все дни недели, а выходные дни выведите жирным.
 */
echo '---------------'.'<br>' ;
$weekRu= [1 =>'Понедельник',2 =>'Вторник',3 =>'Среда',4 =>'Четверг',5 =>'Пятница',6 =>'Суббота',7 =>'Воскресенье' ];
foreach ($weekRu as $k => $day) {
    if ($k  > 0 && $k  < 6){
        echo  "$day" .'<br>';
    } else{
        echo  "<b style='color: red'> $day </b>" .'<br>';
    }

}

/*
 *11. С помощью цикла for заполните массив числами от 1 до 100. То есть у вас должен получится массив [1, 2, 3... 100].
 */
echo '---------------'.'<br>' ;
$arr =[];
for ($i = 1; $i <= 100; $i++)
    array_push($arr, $i);

echo  "[";
foreach ($arr as $value) {
    echo $value .",";
}
echo  "]";


/*
 * 12 .Дан массив $arr. С помощью цикла foreach запишите английские названия в массив $en, а русские - в массив $ru.
 */
echo '---------------'.'<br>' ;

$arr = ['Понедельник','Tuesday', 'Wednesday','Четверг','Пятница','Суббота','Sunday' ];
$en =[];
$ru =[];

foreach ($arr as $word) {
    if (preg_match('/[a-z]/i',$word)) {
        array_push($en, $word);
    }else {
        array_push($ru, $word);
    }
}

print_r($ru);
echo '<br>' ;
print_r($en);
echo '<br>' ;
echo '---------------'.'<br>' ;



/*
 * 13.  Дано число $num=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50.
 *  Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла).
 * Решите задачу сначала через цикл while, а потом через цикл for
 */
$num = 1000;
$c = 1;
$b = 50;
while ($num > $b){
    $num = $num /2 ."<br>";
    $c++;
};

echo "результат деления $num" ;
echo "количество интераций $c" ."<br>";
echo '---------------'.'<br>' ;

$c1 = 1;
$num1 = 1000;
for ($i  =  1000;  $num1>= 50;  $i = $i/2){
    $c1 ++;
    $num1 = $i;
};

echo "результат деления Variant2: $num1"."<br>";
echo "количество интераций Variant2: $c1" ."<br>";
echo '---------------'.'<br>' ;

   ?>
