<?php
/**
 * Created by PhpStorm.
 * User: ANNA
 * Date: 31.03.2019
 * Time: 15:13
 */

/*
 * 1. Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'.
 * */

    $arr = ['Привет', 'мир', '!'];
    echo $arr[0].' '.$arr[1] .' '.$arr[2];
    echo '<br>';

 /*   2. Создайте массив. Выведите на экран, например, элемент с ключом 'c'. */

    $arr = ['j','o','c','q' ];
    echo $arr[2];
    echo '<br>';
    $arr1 = ['j' =>'value1','o' =>'value2','c' =>'value3','q' =>'value4' ];
    echo $arr1['c'];
    echo '<br>';
/*   3. Создайте массив заработных плат $arr. Выведите на экран зарплату Пети и Коли.*/

   $arr = [
       'Петя' =>['salary' => 500],
       'Коля' =>['salary' => 1000 ]
   ];
   echo $arr['Петя']['salary'];
   echo '<br>';
   echo $arr['Коля']['salary'];
    echo '<br>';

    $arr1 = [
           'Петя' =>500 ,
           'Коля' => 1000
       ];
    echo '<br>';
    echo $arr1['Коля'];
    echo '<br>';
    echo $arr1['Петя'];
    echo '<br>';


/*
    4. Создайте массив со значениями 'a', 'b', 'c'. Выведите значение массива на экран с помощью функции var_dump().
    */

    $arr = ['a','b','c','d' ];
    var_dump($arr);
echo '<br>';

/*
5. С помощью массива из предыдущей задачи выведите на экран содержимое первого,
 второго и третьего элементов в отдельных тегах, например используйте тег <p>.
*/


$arr = ['a','b','c','d' ];
foreach ($arr as &$value) {
    $value='<p>'.$value.'</p>';
}
unset($value);
print_r($arr);
echo '<br>';
/*
6. Создайте массив $arr. Найдите сумму элементов этого массива.
*/

$arr = [1,2,5,6,7,12 ];

echo array_sum($arr);
echo '<br>';

/*
7. Создайте ассоциативный массив дней недели. Ключами в нем должны служить номера дней от начала недели
(понедельник - должен иметь ключ 1, вторник - 2 и т.д.). Выведите на экран текущий день недели
*/

$arr1 = [1 =>'Понедельник',2 =>'Вторник',3 =>'Среда',4 =>'Четверг',5 =>'Пятница',6 =>'Суббота',7 =>'Воскресенье' ];
echo date("N");
echo '<br>';
echo $arr1[date("N")] .'<br>' ;
/*
 8. Создайте многомерный массив. С его помощью выведите на экран слова 'joomla', 'drupal', 'зеленый', 'красный'.

 */


$arr2[0][0]="joomla";
$arr2[0][1]="drupal";
$arr2[1][0]="зеленый";
$arr2[1][1]="красный";

for ($q=0; $q<2; $q++) {
    for ($w=0; $w<2; $w++) {
        echo $arr2[$q][$w]." ";
    }
    echo '<br>';
}




   ?>
